#include<iostream>

using namespace std;

int main()

{int n;
setlocale(LC_ALL,"russian");

cin>>n;

if(n==10)

cout<<"десять учебных заданий"<<endl;

if(n==11)

cout<<"одиннадцать учебных заданий"<<endl;

if(n==12)

cout<<"двенадцать учебных заданий"<<endl;

if(n==13)

cout<<"тринадцать учебных заданий"<<endl;

if(n==14)

cout<<"четырнадцать учебных заданий"<<endl;

if(n==15)

cout<<"пятнадцать учебных заданий"<<endl;

if(n==16)

cout<<"шестнадцать учебных заданий"<<endl;

if(n==17)

cout<<"семнадцать учебных заданий"<<endl;

if(n==18)

cout<<"восемнадцать учебных заданий"<<endl;

if(n==19)

cout<<"девятнадцать учебных заданий"<<endl;

if(n==20)

cout<<"двадцать учебных заданий"<<endl;

if(n==21)

cout<<"двадцать одно учебное задание"<<endl;

if(n==22)

cout<<"двадцать два учебных задания"<<endl;

if(n==23)

cout<<"двадцать три учебных задания"<<endl;

if(n==24)

cout<<"двадцать четыре учебных задания"<<endl;

if(n==25)

cout<<"двадцать пять учебных заданий"<<endl;

if(n==26)

cout<<"двадцать шесть учебных заданий"<<endl;

if(n==27)

cout<<"двадцать семь учебных заданий"<<endl;

if(n==28)

cout<<"двадцать восемь учебных заданий"<<endl;

if(n==29)

cout<<"двадцать девять учебных заданий"<<endl;

if(n==30)

cout<<"тридцать учебных заданий"<<endl;

if(n==31)

cout<<"тридцать одно учебное задание"<<endl;

if(n==32)

cout<<"тридцать два учебных задания"<<endl;

if(n==33)

cout<<"тридцать три учебных задания"<<endl;

if(n==34)

cout<<"тридцать четыре учебных задания"<<endl;

if(n==35)

cout<<"тридцать пять учебных заданий"<<endl;

if(n==36)

cout<<"тридцать шесть учебных заданий"<<endl;

if(n==37)

cout<<"тридцать семь учебных заданий"<<endl;

if(n==38)

cout<<"тридцать восемь учебных заданий"<<endl;

if(n==39)

cout<<"тридцать девять учебных заданий"<<endl;

if(n==40)

cout<<"сорок учебных заданий"<<endl;
system ("pause");
return 0;

}

